app/controllers/questions_controller.rb

INSERT INTO "questions" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test test test"], ["created_at", "2015-12-23 01:05:02.743474"], ["updated_at", "2015-12-23 01:05:02.743474"]]
---
  def create
    @question = Question.new(question_params)
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."question_id" = $1  [["question_id", 3]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."question_id" = $1 AND "votes"."answer" = $2  [["question_id", 3], ["answer", "t"]]
SELECT "votes".* FROM "votes" WHERE "votes"."response" = $1  [["response", "Puerto Vallarta"]]
---
  def show
    @question = Question.find(params[:id])
    @votes = Vote.where(question_id: (params[:id]))
    @trues = @votes.where(answer: true).size
    @falses = @votes.where(answer: false).size
    @responses = Vote.where(response: @question.response)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 10]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."question_id" = $1 AND "votes"."answer" = $2  [["question_id", 10], ["answer", "t"]]
---
  def show_result
    @question = Question.find(params[:id])
    @votes = Vote.where(question_id: (params[:id]))
    @trues = @votes.where(answer: true).size